mlsorensen/Apollo2/src/device/main.cpp
#include <Arduino.h>
#include <NimBLEDevice.h>

#include <cstdlib>
#include <cstring>
#include <Wire.h>
#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
#include <esp32-hal-hosted.h>  // hostedInitBLE(): SDIO link to the radio co-processor
#endif
#include <esp_sleep.h>
#include <soc/soc_caps.h>
#if SOC_PM_SUPPORT_EXT0_WAKEUP
#include <driver/rtc_io.h>
#endif
#include <lvgl.h>

#include <esp_heap_caps.h>
#include <esp_ota_ops.h>
#include <hal/efuse_hal.h>
#if __has_include(<esp_core_dump.h>)
#include <esp_core_dump.h>
#endif

#include "core/brew_controller.h"
#include "core/log_ring.h"
#include "core/system.h"
#include "platform_esp32/battery.h"
#include "platform_esp32/board_config.h"
#include "platform_esp32/c6_update.h"
#include "platform_esp32/clock.h"
#include "platform_esp32/config.h"
#include "platform_esp32/display.h"
#include "platform_esp32/display_settings.h"
#include "platform_esp32/history.h"
#include "platform_esp32/install_mode.h"
#include "platform_esp32/io_extension.h"
#include "platform_esp32/log_setup.h"
#include "platform_esp32/micra_link.h"
#include "platform_esp32/network.h"
#include "platform_esp32/update_check.h"
#include "platform_esp32/paddle.h"
#include "platform_esp32/provisioner.h"
#include "platform_esp32/scale_link.h"
#include "platform_esp32/shot_store.h"
#include "platform_esp32/sound.h"
#include "platform_esp32/scale_provisioner.h"
#include "platform_esp32/token_setup.h"
#include "platform_esp32/touch.h"
#include "platform_esp32/web_ui.h"
#include "ui/app.h"
#include "ui/theme.h"
#include "version.h"

// Device entry. Brings up the panel + touch, builds the UI bound to the BLE
// machine, and starts MicraLink's background connection task. The main loop only
// runs LVGL and periodically refreshes the UI from MicraLink's cached snapshot —
// all BLE I/O (connect, poll, reconnect) happens off-thread, so the UI stays
// responsive whether the machine is connected, connecting, or offline.

namespace {

platform::Display g_display;
platform::Touch g_touch;
platform::Config g_config;
platform::MicraLink g_micra;
platform::TokenSetup g_token_setup{g_config, g_micra};
platform::Provisioner g_provisioner{g_micra, g_config, g_token_setup};
platform::Battery g_battery;
platform::DisplaySettings g_display_settings{g_display, g_config};
platform::Clock g_clock{g_config};
platform::Network g_network{g_config, g_clock, g_token_setup};  // WiFi station + NTP
platform::UpdateCheck g_update_check{g_config, g_network};  // daily release check
platform::History g_history;
platform::ScaleLink g_scale;            // NimBLE Bluetooth scale (Bookoo/Acaia)
platform::ScaleProvisioner g_scale_provisioner{g_scale, g_config};
// Brew-by-weight: paddle relay + shot state machine over the paddle + scale
// ports (core logic; polled from loop()).
core::BrewController g_brew{platform::paddle(), g_scale};
// Shot history: SD-backed on boards with a card slot; NullShotStore elsewhere
// (the History tab shows guidance instead).
#if defined(BOARD_HAS_SD_MMC)
platform::ShotStore g_shots;
#else
core::NullShotStore g_shots;
#endif
platform::WebUi g_web_ui;  // the ONE HTTP server (setup portal + history app)
ui::App g_app;

constexpr uint32_t kUiRefreshMs = 500;
constexpr uint32_t kSampleMs =
    platform::History::kSampleIntervalS * 1000;  // temperature history cadence

// Survives deep sleep (cleared only on a cold boot / power loss): set when we park
// for low battery so the next wake does the dark battery check in setup() before
// powering anything up.
RTC_DATA_ATTR uint32_t g_lowbatt_sleep = 0;

// Deep sleep until a screen touch (or external reset). True power-down (~uA) — no
// timer poll. The touch controller's INT line (idles high, pulls low on touch) is
// the wake source where it's on an RTC GPIO; the 2-inch has no INT wired
// (kTouchInt < 0), so there it wakes only on reset.
void enter_lowbatt_sleep() {
  g_lowbatt_sleep = 1;
  if (board::kTouchInt >= 0) {
    const auto pin = static_cast<gpio_num_t>(board::kTouchInt);
#if SOC_PM_SUPPORT_EXT0_WAKEUP
    rtc_gpio_pullup_en(pin);
    rtc_gpio_pulldown_dis(pin);
    esp_sleep_enable_ext0_wakeup(pin, 0);  // wake when INT goes low (a touch)
#elif SOC_PM_SUPPORT_EXT1_WAKEUP
    // Chips without EXT0 (e.g. the P4): EXT1 with a one-pin mask, wake on low.
    esp_sleep_enable_ext1_wakeup(1ULL << pin, ESP_EXT1_WAKEUP_ANY_LOW);
#endif
  }
  esp_deep_sleep_start();  // never returns
}

// Minimal init to read the pack WITHOUT lighting the screen (the dark check on a
// low-battery wake). The 2-inch reads a direct ADC (no init); the 7B reads via the
// I2C IO-extension, so bring that up but force the backlight off.
void batt_only_init() {
#if defined(BOARD_HAS_IO_EXTENSION)
  Wire.begin(board::kI2cSda, board::kI2cScl);
  platform::io_extension().begin(board::kIoExtAddr);
  platform::io_extension().set(board::kIoExtBacklight, false);
#endif
}

}  // namespace

// Arduino weak-hook override: do NOT auto-confirm an OTA-installed image at
// init — loop() confirms it after 60 s of healthy running (above), so a build
// that boots but immediately crashes still rolls back.
extern "C" bool verifyRollbackLater() { return true; }

void setup() {
  Serial.begin(115200);
#if defined(ARDUINO_USB_CDC_ON_BOOT) && ARDUINO_USB_CDC_ON_BOOT
  // Native USB-CDC: with no serial host attached, writes otherwise BLOCK on a TX
  // timeout until the buffer drains — which stalls the main loop (and thus touch/
  // rendering) whenever anything logs. 0 = never block (drop if no reader). This
  // is why the UI felt sluggish until a serial monitor was connected. (Boards on
  // a real UART bridge — e.g. the P4 — don't have or need this.)
  Serial.setTxTimeoutMs(0);
#endif

  // Woke from a low-battery park (a touch or a reset)? Read the pack WITHOUT
  // powering up the panel/LVGL/BLE and REFUSE to fully boot unless it has charged
  // past the resume threshold (hysteresis above the cutoff, so the at-rest voltage
  // rebound doesn't count) — otherwise go straight back to sleep. This avoids a
  // half-up, backlight-off zombie that would only brown out again; the device
  // stays dark until there's genuinely enough power to run.
  if (g_lowbatt_sleep) {
    batt_only_init();
    const core::BatteryState b = g_battery.battery();
    // On USB (node at/above the USB threshold) or rested past the resume level
    // -> boot. A pack still charging below the resume level stays parked; it'll
    // pass the threshold as it charges.
    if (!(b.usb || b.volts >= board::kBatteryResumeVolts)) enter_lowbatt_sleep();
    g_lowbatt_sleep = 0;  // charged enough -> fall through to a normal boot
  }

  // Log ring before the first diagnostic, so the banner onward is replayable
  // from Stats > Info or http://<ip>/log after the fact.
  platform::log_init();

